stokes_flow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://www.openfoam.org
    \\  /    A nd           | Version:  v2106
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.e3 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.e3 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    cylinder
    {
        type            noSlip;
    }

    top
    {
        type            cyclic;
    }

    bottom
    {
        type            cyclic;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
